DELETE FROM em_saas.code;
INSERT INTO em_saas.code (code, first_code, second_code, third_code, code_value, seq) VALUES
('MTP0000', 'MTP', '00', '00', '- 회원 구분', 0),
('MTP0001', 'MTP', '00', '01', '일반회원', 1),
('MTP0002', 'MTP', '00', '02', '관리자', 2),
('MTP0003', 'MTP', '00', '03', '애널리스트', 3),

('MST0000', 'MST', '00', '00', '- 회원 상태', 0),
('MST0001', 'MST', '00', '01', '인증대기', 1),
('MST0002', 'MST', '00', '02', '인증완료', 2),
('MST0003', 'MST', '00', '03', '정지', 3),
('MST0004', 'MST', '00', '04', '탈퇴', 4),

('ETP0000', 'ETP', '00', '00', '- 메일 구분', 0),
('ETP0001', 'ETP', '00', '01', '회원가입 인증', 1),
('ETP0002', 'ETP', '00', '02', '비밀번호 찾기', 2),
('ETP0003', 'ETP', '00', '03', '프로젝트 초대', 3),

('PST0000', 'PST', '00', '00', '- 파트너쉽 관리 구분', 0),
('PST0001', 'PST', '00', '01', '관리자', 1),
('PST0002', 'PST', '00', '02', '일반', 2),

('PMS0000', 'PMS', '00', '00', '- 파트너쉽 회원 상태', 0),
('PMS0001', 'PMS', '00', '01', '정상', 1),
('PMS0002', 'PMS', '00', '02', '정지', 2),
('PMS0003', 'PMS', '00', '03', '삭제', 3),
('PMS0004', 'PMS', '00', '04', '대기', 4),

('PJS0000', 'PJS', '00', '00', '- 프로젝트 상태', 0),
('PJS0001', 'PJS', '00', '01', '생성/기본정보 입력', 1),
('PJS0002', 'PJS', '00', '02', '엑셀 업로드', 2),
('PJS0003', 'PJS', '00', '03', '노드&엣지 정의', 3),
('PJS0004', 'PJS', '00', '04', '기능 정의', 4),
('PJS0005', 'PJS', '00', '05', '속성 정의', 5),
('PJS0006', 'PJS', '00', '06', '노드&엣지 정제중', 6),
('PJS0007', 'PJS', '00', '07', '정제 오류', 7),
('PJS0008', 'PJS', '00', '08', '설정 완료', 8),

('PFC0000', 'PFC', '00', '00', '- 프로젝트 업로드 파일 구분', 0),
('PFC0001', 'PFC', '00', '01', '단일 파일', 1),
('PFC0002', 'PFC', '00', '02', '멀티 파일(노드)', 2),
('PFC0003', 'PFC', '00', '03', '멀티 파일(엣지)', 3),

('PMT0000', 'PMT', '00', '00', '- 프로젝트 사용자 구분', 0),
('PMT0001', 'PMT', '00', '01', '관리자', 1),
('PMT0002', 'PMT', '00', '02', '구성원', 2),

('PTT0000', 'PTT', '00', '00', '- 프로젝트 테이블 구분', 0),
('PTT0001', 'PTT', '00', '01', 'node', 1),
('PTT0002', 'PTT', '00', '02', 'edge', 2),

('PTA0000', 'PTA', '00', '00', '- 프로젝트 테이블 사용자 권한', 0),
('PTA0001', 'PTA', '00', '01', '읽기', 1),
('PTA0002', 'PTA', '00', '02', '수정', 2),

('PQT0000', 'PQT', '00', '00', '- 프로젝트 쿼리 타입', 0),
('PQT0001', 'PQT', '00', '01', 'Mongo-Shell', 1),
('PQT0002', 'PQT', '00', '02', 'Mongo-JSON', 2),

('RST0000', 'RST', '00', '00', '- LLM sender Type', 0),
('RST0001', 'RST', '00', '01', 'USER', 1),
('RST0002', 'RST', '00', '02', 'ASSISTANT', 2),


('TTC0000', 'TTC', '00', '00', '- LLM 외부 도구 타입', 0),
('TTC0001', 'TTC', '00', '01', 'get_search_result_by_query_tool', 1);
