DELETE FROM em_saas.code;
INSERT INTO em_saas.code (code, first_code, second_code, third_code, code_value, seq) VALUES
('MTP0000', 'MTP', '00', '00', '- 회원 구분', 0),
('MTP0001', 'MTP', '00', '01', '일반회원', 1),
('MTP0002', 'MTP', '00', '02', '관리자', 2),
('MTP0003', 'MTP', '00', '03', '애널리스트', 3),

('MST0000', 'MST', '00', '00', '- 회원 상태', 0),
('MST0001', 'MST', '00', '01', '인증대기', 1),
('MST0002', 'MST', '00', '02', '인증완료', 2),
('MST0003', 'MST', '00', '03', '정지', 3),
('MST0004', 'MST', '00', '04', '탈퇴', 4),

('ETP0000', 'ETP', '00', '00', '- 메일 구분', 0),
('ETP0001', 'ETP', '00', '01', '회원가입 인증', 1),
('ETP0002', 'ETP', '00', '02', '비밀번호 찾기', 2),
('ETP0003', 'ETP', '00', '03', '프로젝트 초대', 3),

('PST0000', 'PST', '00', '00', '- 파트너쉽 관리 구분', 0),
('PST0001', 'PST', '00', '01', '관리자', 1),
('PST0002', 'PST', '00', '02', '일반', 2),

('PMS0000', 'PMS', '00', '00', '- 파트너쉽 회원 상태', 0),
('PMS0001', 'PMS', '00', '01', '정상', 1),
('PMS0002', 'PMS', '00', '02', '정지', 2),
('PMS0003', 'PMS', '00', '03', '삭제', 3),
('PMS0004', 'PMS', '00', '04', '대기', 4),

('PJS0000', 'PJS', '00', '00', '- 프로젝트 상태', 0),
('PJS0001', 'PJS', '00', '01', '임시저장(MongoDB)', 1),
('PJS0002', 'PJS', '00', '02', '저장(RDB)', 2),
('PJS0003', 'PJS', '00', '03', '저장(Neo4j)', 3);
